Revit 2027 API
DividedSurface.CanBeDivided Method
 This returns true if the reference represents a face that can be used to create a divided surface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool CanBeDivided(
	Document document,
	Reference reference
)
Public Shared Function CanBeDivided (
	document As Document,
	reference As Reference
) As Boolean
public:
static bool CanBeDivided(
	Document^ document,
	Reference^ reference
)
static member CanBeDivided :
        document : Document *
        reference : Reference -> bool
Parameters
document Document
 The document.
reference Reference
 The reference.
Return Value
Boolean
 True if the reference can be used to create a divided surface, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DividedSurface Class
Autodesk.Revit.DB Namespace